
export const CatalogData = [
  {
    image: "/Gauge/02_2.jpg",
    title: "Датчик давления",
    country: "Утвержден",
    description:
      "Один из лучших российских интеллектуальных датчиков давления с широкими функциональными возможностями и русскоязычным меню. Датчики предназначены для непрерывного преобразования в унифицированный токовый выходной сигнал или в сигнал напряжения постоянного тока, а также в цифровой сигнал в стандарте протокола HART или Foundation Fieldbus входных измеряемых величин.",
    author: "Кашапов Азат Ильзович",
    imgauthor: "/8866.jpg",
    link: "/characteristics",
  },
  {
    image: "/Gauge/ТЕМП.jpg",
    title: "Датчик температуры ТЕМП-01 ",
    country: "Утвержден",
    description:
      "Многоточечный датчик температуры ТЕМП-01 (преобразователь температуры) предназначен для непрерывного измерения температуры жидких продуктов (нефть, нефтепродукты, пищевые жидкости и др.) в нескольких точках и может применяться на базах хранения и технологических емкостях как в системах коммерческого учета, так и автономно. Прибор преобразовывает сигнал с датчиков температуры и выдает его по интерфейсу RS-485 в АСУ верхнего уровня.",
    author: " Шевцов Владимир Иванович",
    imgauthor: "/8866.jpg",
    link: "",
  },
  {
    image: "/Gauge/ИСУ.jpg",
    title: "Датчики для уровнемеров ИСУ100И",
    country: "Утвержден",
    description:
      "Аналоговые датчики уровня Е предназначены для непрерывного измерения уровня различных жидких и сыпучих сред. Дискретные датчики уровня ЕС предназначены для сигнализации предельного уровня различных жидких и сыпучих сред.",
    author: "Круглова Анастасия Павловна",
    imgauthor: "/8866.jpg",
    link: "",
  },
  {
    image: "/Gauge/дрс.jpg",
    title: "Датчик расхода жидкости типа ДРС",
    country: "Не прошел проверку",
    description:
      "Датчик расхода ДРС предназначен для измерения нефти, нефтепродуктов, воды, их смесей, сжиженных газов и других жидкостей в технологических процессах нефтедобывающей, нефтеперерабатывающей отраслей, а также на промышленных предприятиях и в коммунальном хозяйстве.",
    author: "Зеленин Савелий Семёнович",
    imgauthor: "/8866.jpg",
    link: "",
  },
  
];
