 export const mockdata = [
   {
     title:
       "Новая серия LCR-782xxА высокочастотных прецизионных анализаторов RLC компонентов",
     image: "/News/LCR_78205A_F.jpg",
     date: "October 18-20, 2023",
   },
   {
     title:
       "Новые лабораторные прецизионные измерители RLC-параметров АКТАКОМ АММ-3087 и АКТАКОМ АММ-3089 с встроенными функциями сканирования и графического анализа пополнили номенклатурный список товарных предложений в категории измерители электронных компонентов. ",
     image: "/News/c_AMM_3089.jpg",
     date: "May 30, 2023",
   },
   {
     title:
       "Устройство ЭнИ-3120-DI - это одно- или двухканальный модуль гальванической развязки, предназначенный для подключения датчиков с выходными дискретными сигналами, в том числе с контролем цепи, а так же датчиков с выходным сигналом NAMUR EN 60947-5-6",
     image: "/News/eni-3120-di_f.jpg",
     date: "May 26, 2023",
   },
   {
     title:
       "Изделие MATRIX MPS-3063X представляет собой 3-х канальный программируемый источник питания постоянного тока (2 канала: 30Вх6А + 1 канал: 6Вх3А) vjoyjcnm. 180 Вт",
     image: "/News/Ma.png",
     date: "",
   },
   {
     title:
       "Администрация компании «РусАвтоматизация» заключила Договор с ООО «СибПром Тест» на проведение технических и организационных работ по сертификации впускаемых на предприятии магнитных индикаторов уровня требованиям ТР ТС 012/2011 О безопасности оборудования для работы во взрывоопасных средах. Полное завершение процедуры планируется завершить до окончания 2023 года.",
     image: "/News/c_xson_gt_lev.jpg",
     date: "May 30, 2023",
   },
   {
     title:
       "В 2023-ем году ведущий российский приборостроительный завод «ЭЛЕМЕР» продолжает успешно расширять свой ареал международного сотрудничества и границы сферы применения выпускаемого контрольно-измерительного оборудования.Ярким примером этого тезиса станет участие НПП «ЭЛЕМЕР» в крупнейшей международной отраслевой  технической выставке «Нефть и газ Каспия - 2023», которая пройдет в столице Азербайджана в городе  Баку, в период 31 мая -2 июня, в рамках традиционной Бакинской энергетической недели (Baku Energy Week)..",
     image: "/News/ELM_Bak_23.jpg",
     date: "May 30, 2023",
   },
 ];
