import { TableInterfaceProps } from "../types/table.interface";

export const TableInterfaceData1: TableInterfaceProps[] = [
  {
    id: 1,
    title:
      "По автоматизированным системам управления технологическими процессами",
    info: "(АСУ ТП) — группа решений технических и программных средств, предназначенных для автоматизации управления Технологическим процессом.",
  },
  {
    id: 2,
    title: "По метрологии и техническим измерениям и приборам",
    info: "Метрология — наука об измерениях, методах и средствах обеспечения их единства и способах достижения требуемой точности.",
  },
  {
    id: 3,
    title: "По электронике и устройствам цифровой автоматики",
    info: "Электроника — наука о взаимодействии электронов с электромагнитными полями и методах создания электронных приборов и устройств для преобразования электромагнитной энергии, в основном для передачи, обработки и хранения информации.",
  },
  {
    id: 4,
    title:
      "По контролю над разработкой нефтяных месторождений и геофизическим методам и приборам",
    info: "Методы контроля над разработкой месторождений — это перечень правил и рекомендаций, которые способствуют эффективному установлению и продуктивному использованию залежей сырья.",
  },
  {
    id: 5,
    title: "По программному обеспечению процессов нефтегазодобычи",
    info: "Программное обеспечение — это набор инструкций, позволяющий пользователю взаимодействовать с компьютером, его аппаратной частью, выполнять задачи",
  },
  {
    id: 6,
    title: "По автоматизации систем управления цехами добычи нефти и газа",
    info: "Процесс сбора и транспортировки нефти и газа – это комплекс мероприятий, направленный на автоматизацию и контроль над каждой стадией профильной деятельности. Фактически это установка нового оборудования, считывающих устройств и объединение их с компьютерной системой обработки данных.",
  },
  {
    id: 7,
    title: "По контрольно-измерительным приборам и автоматике",
    info: "Процесс сбора и транспортировки нефти и газа – это комплекс мероприятий, направленный на автоматизацию и контроль над каждой стадией профильной деятельности. Фактически это установка нового оборудования, считывающих устройств и объединение их с компьютерной системой обработки данных.",
  },
];
