import {
  TeacherData,
  TeacherDataProps,
} from "@/types/teacher/teacher-info.interface";

export const teacherData: TeacherDataProps = {
  data: [
    {
      id: 1,
      teacherInfo: {
        imageUrl: "/teacher-photos/IP.webp",
        position:
          "Заведующий кафедрой автоматизации и информационных технологий",
        fullName: "Ситдикова Ирина Петровна",
      },
      contacts: {
        phone: "8 (8553) 31-01-51",
        email: "sitdikova_ip@mail.ru",
        title: "Контактная информация",
      },
      interests: [
        {
          title: "Профессиональные интересы",
          interests: [
            {
              id: 1,
              text: "Метрология и измерительная техника",
            },
            {
              id: 2,
              text: "Интеллектуальные системы упралвения",
            },
          ],
        },
      ],
      responsibilities: [
        {
          title: "Полномочия / обязанности",
          responsibilities: [
            {
              id: 1,
              text: "Осуществление планирования, организации и контроля учебной, воспитательной и учебно-методической работы по читаемым дисциплинам.",
            },
            {
              id: 2,
              text: "Ведение всех видов учебных занятий, руководство курсовыми работами обучающихся.",
            },
            {
              id: 3,
              text: "Участие в разработке образовательных программ института.",
            },
            {
              id: 4,
              text: "Организация, руководство и ведение научно-исследовательской работы по профилю кафедры.",
            },
            {
              id: 5,
              text: "Участие в профориентации абитуриентов.",
            },
          ],
        },
        {
          title: "Образование, учёные степени",
          responsibilities: [
            {
              id: 1,
              text: "Участие в профориентации абитуриентов.",
            },
            {
              id: 2,
              text: "Участие в профориентации абитуриентов.",
            },
            {
              id: 3,
              text: "Участие в профориентации абитуриентов.",
            },
          ],
        },
      ],
    },
    {
      id: 2,
      teacherInfo: {
        imageUrl: "/teacher-photos/RR.webp",
        position: "Доцент кафедры автоматизации и информационных технологий",
        fullName: "Ахметзянов Рустам Расимович",
      },

      contacts: {
        phone: "",
        email: "",
        title: "",
      },
      interests: [
        {
          title: "",
          interests: [],
        },
      ],
      responsibilities: [
        {
          title: "Полномочия / обязанности",
          responsibilities: [],
        },
        {
          title: "Образование, учёные степени",
          responsibilities: [],
        },
      ],
    },
    {
      id: 3,
      teacherInfo: {
        imageUrl: "/teacher-photos/KL.webp",
        position: "Доцент кафедры автоматизации и информационных технологий",
        fullName: "Горшкова Кристина Леонидовна",
      },
      contacts: {
        phone: "8 (8553) 31-01-51",
        email: "k.gorshkova@agni-rt.ru",
        title: "Контактная информация",
      },
      interests: [
        {
          title: "Профессиональные интересы",
          interests: [
            {
              id: 1,
              text: "Цифровые технологии",
            },
            {
              id: 2,
              text: "Нейронные сети",
            },
            {
              id: 3,
              text: "Нечеткая логика",
            },
            {
              id: 4,
              text: "Интеллектуальное системы управления",
            },
          ],
        },
      ],
      responsibilities: [
        {
          title: "Полномочия / обязанности",
          responsibilities: [
            {
              id: 1,
              text: "Ведение всех видов учебных занятий, руководство курсовых работ, производственных практик, научно-исследовательских и выпускных квалификационных работ (бакалавриат и магистратура). ",
            },
            {
              id: 2,
              text: "Участие в подготовке образовательных программ кафедры. ",
            },
            {
              id: 3,
              text: "Ведение научно-исследовательской работы по профилю кафедры. ",
            },
            {
              id: 4,
              text: "Участие в профориентации абитуриентов.",
            },
          ],
        },
        {
          title: "Образование, учёные степени",
          responsibilities: [
            {
              id: 1,
              text: "2019 год - ученое звание: доцент по специальности «Автоматизация и управление технологическими процессами и производствами»",
            },
            {
              id: 2,
              text: "2015 год  - кандидат технических наук: специальность 05.13.01 «Системный анализ, управление и обработка информации (промышленность)»",
            },
            {
              id: 3,
              text: "2009 год - специалитет: Альметьевский государственный нефтяной институт, специальность - «Автоматизация технологических процессов и производств», квалификация: «Инженер».",
            },
          ],
        },
      ],
    },
    {
      id: 4,
      teacherInfo: {
        imageUrl: "/teacher-photos/LG.webp",
        position: "Доцент кафедры автоматизации и информационных технологий",
        fullName: "Тугашова Лариса Геннадьевна",
      },
      contacts: {
        phone: "8 (8553) 31-01-51",
        email: "tugashova@yandex.ru",
        title: "Контактная информация",
      },
      interests: [
        {
          title: "Профессиональные интересы",
          interests: [
            {
              id: 1,
              text: "Моделирование процессов подготовки нефти к переработке",
            },
            {
              id: 2,
              text: "Управление процессами подготовки нефти к переработке",
            },
          ],
        },
      ],
      responsibilities: [
        {
          title: "Полномочия / обязанности",
          responsibilities: [
            {
              id: 1,
              text: "Осуществление планирования, организации и контроля учебной, воспитательной и учебно-методической работы по читаемым дисциплинам.",
            },
            {
              id: 2,
              text: "Ведение всех видов учебных занятий, руководство курсовыми работами обучающихся.",
            },
            {
              id: 3,
              text: "Участие в разработке образовательных программ института.",
            },
            {
              id: 4,
              text: "Организация, руководство и ведение научно-исследовательской работы по профилю кафедры.",
            },
            {
              id: 5,
              text: "Участие в профориентации абитуриентов.",
            },
          ],
        },
        {
          title: "Образование, учёные степени",
          responsibilities: [
            {
              id: 1,
              text: "2006 год - ученое звание: доцент.",
            },
            {
              id: 2,
              text: "2004 год - кандидат технических наук: специальность 05.13.06 – «Автоматизация и управление технологическими процессами и производствами» (по отраслям). ",
            },
            {
              id: 3,
              text: "1990 год - специалист: Московский институт нефти и газа им. И.М.Губкина, г. Москва специальность - «Автоматика и телемеханика», квалификация: «Инженер».",
            },
          ],
        },
      ],
    },
    {
      id: 5,
      teacherInfo: {
        imageUrl: "/teacher-photos/NN.webp",
        position: "Доцент кафедры автоматизации и информационных технологий",
        fullName: "Алаева Наталья Николаевна",
      },
      contacts: {
        phone: "8 (8553) 31-01-51",
        email: "nalaeva@yandex.ru",
        title: "Контактная информация",
      },
      interests: [
        {
          title: "Профессиональные интересы",
          interests: [
            {
              id: 1,
              text: "Глубинные комплексы для контроля технологических параметров скважины",
            },
            {
              id: 2,
              text: "Интеллектуальные системы управления процессом добычи нефти",
            },
          ],
        },
      ],
      responsibilities: [
        {
          title: "Полномочия / обязанности",
          responsibilities: [
            {
              id: 1,
              text: "Ведение учебных занятий, руководство курсовыми работами, практиками (учебная, производственная) и выпускными квалификационными работами обучающихся.",
            },
            {
              id: 2,
              text: "Участие в подготовке образовательных программ кафедры.",
            },
            {
              id: 3,
              text: "Ведение научно-исследовательской работы по профилю кафедры.",
            },
            {
              id: 4,
              text: "Участие в профориентации абитуриентов.",
            },
          ],
        },
        {
          title: "Образование, учёные степени",
          responsibilities: [
            {
              id: 1,
              text: "2021 год - кандидат технических наук: специальность 05.13.06 «Автоматизация и управление технологическими процессами и производствами (в машиностроении и приборостроении)».",
            },
            {
              id: 2,
              text: "2003 год - специалитет: Альметьевский нефтяной институт, специальность - «Автоматизация технологических процессов и производств», квалификация: «Инженер».",
            },
          ],
        },
      ],
    },
    {
      id: 6,
      teacherInfo: {
        imageUrl: "/teacher-photos/NV.webp",
        position:
          "Старший преподаватель кафедры автоматизации и информационных технологий",
        fullName: "Абдулкина Наталья Владимировна",
      },
      contacts: {
        phone: "8 (8553) 31-01-51",
        email: "n.abdulkina@agni-rt.ru",
        title: "Контактная информация",
      },
      interests: [
        {
          title: "Профессиональные интересы",
          interests: [
            {
              id: 1,
              text: "Контроль технологических параметров при бурении нефтяной скважины",
            },
            {
              id: 2,
              text: "Средства автоматизации и управления",
            },
          ],
        },
      ],
      responsibilities: [
        {
          title: "Полномочия / обязанности",
          responsibilities: [
            {
              id: 1,
              text: "Ведение всех видов учебных занятий, руководство курсовыми работами и выпускными квалификационными работами обучающихся.",
            },
            {
              id: 2,
              text: "Участие в разработке образовательных программ института.",
            },
            {
              id: 3,
              text: "Руководство и ведение проектом по рабочим профессиям в институте.",
            },
            {
              id: 4,
              text: "Участие в научно-исследовательской работе по профилю кафедры.",
            },
            {
              id: 5,
              text: "Участие в профориентации абитуриентов.",
            },
          ],
        },
        {
          title: "Образование, учёные степени",
          responsibilities: [
            {
              id: 1,
              text: "2011 год - специалист: ГБОУ ВПО «Альметьевский государственный нефтяной институт», г. Альметьевск, специальность - «Экономика и управление на предприятиях нефтяной и газовой промышленности», квалификация: «Экономист-менеджер». ",
            },
            {
              id: 2,
              text: "1998 год - специалист: Альметьевский нефтяной институт, г. Альметьевск, специальность - «Автоматизация технологических процессов и производств», квалификация: «Инженер».",
            },
          ],
        },
      ],
    },
    {
      id: 7,
      teacherInfo: {
        imageUrl: "/teacher-photos/RN.webp",
        position:
          "Старший преподаватель кафедры автоматизации и информационных технологий",
        fullName: "Зарипова Регина Наилевна",
      },
      contacts: {
        phone: "8 (8553) 31-01-51",
        email: "zaripovarn@mail.ru",
        title: "Контактная информация",
      },
      interests: [
        {
          title: "Профессиональные интересы",
          interests: [
            {
              id: 1,
              text: "Автоматическое управление",
            },
            {
              id: 2,
              text: "Информационные сети",
            },
            {
              id: 3,
              text: "Надежность систем",
            },
          ],
        },
      ],
      responsibilities: [
        {
          title: "Полномочия / обязанности",
          responsibilities: [
            {
              id: 1,
              text: "Ведение учебных занятий, руководство курсовыми работами, практиками (учебная, производственная) и выпускными квалификационными работами обучающихся.",
            },
            {
              id: 2,
              text: "Участие в подготовке образовательных программ кафедры.",
            },
            {
              id: 3,
              text: "Ведение научно-исследовательской работы по профилю кафедры.",
            },
            {
              id: 4,
              text: "Участие в профориентации абитуриентов.",
            },
          ],
        },
        {
          title: "Образование, учёные степени",
          responsibilities: [
            {
              id: 1,
              text: "2003 год - специалитет: Альметьевский нефтяной институт, специальность - «Автоматизация технологических процессов и производств», квалификация: «Инженер».",
            },
          ],
        },
      ],
    },
    {
      id: 8,
      teacherInfo: {
        imageUrl: "/teacher-photos/AI.webp",
        position:
          "Старший преподаватель кафедры автоматизации и информационных технологий",
        fullName: "Каюмова Асия Ильгизаровна",
      },
      contacts: {
        phone: "8 (8553) 31-01-51",
        email: "kaumova1208@mail.ru",
        title: "Контактная информация",
      },
      interests: [
        {
          title: "Профессиональные интересы",
          interests: [
            {
              id: 1,
              text: "Профессиональные интересы",
            },
            {
              id: 2,
              text: "Измерительная техника",
            },
            {
              id: 3,
              text: "Интеллектуальные системы управления",
            },
          ],
        },
      ],
      responsibilities: [
        {
          title: "Полномочия / обязанности",
          responsibilities: [
            {
              id: 1,
              text: "Ведение учебных занятий, руководство курсовыми работами, практиками (учебная, производственная) и выпускными квалификационными работами обучающихся.",
            },
            {
              id: 2,
              text: "Участие в подготовке образовательных программ кафедры. ",
            },
            {
              id: 3,
              text: "Ведение научно-исследовательской работы по профилю кафедры.",
            },
            {
              id: 4,
              text: "Участие в профориентации абитуриентов.",
            },
          ],
        },
        {
          title: "Образование, учёные степени",
          responsibilities: [
            {
              id: 1,
              text: "2005 год - специалист: Альметьевский государственный нефтяной институт, г. Альметьевск, специальность: «Автоматизация технологических процессов и производств», квалификация: инженер.",
            },
          ],
        },
      ],
    },
    {
      id: 9,
      teacherInfo: {
        imageUrl: "/teacher-photos/GF.webp",
        position: "Заведущий лабораторией кафедры автоматизации и ИТ",
        fullName: "Миниханова Гульнара Фаридовна",
      },
      contacts: {
        phone: "",
        email: "",
        title: "",
      },
      interests: [
        {
          title: "",
          interests: [],
        },
      ],
      responsibilities: [
        {
          title: "Полномочия / обязанности",
          responsibilities: [],
        },
        {
          title: "Образование, учёные степени",
          responsibilities: [],
        },
      ],
    },
  ],
};
